# SetLBColumnImage

## Description
Draws an icon instead of text on a list browser header column.  Use with AddLBImage.

```pascal
FUNCTION SetLBColumnImage(
				nDialogID    : LONGINT;
				nComponentID : LONGINT;
				nColumnIndex : INTEGER;
				nImageIndex  : INTEGER) : BOOLEAN;
```

```python

def vs.SetLBColumnImage(nDialogID, nComponentID, nColumnIndex, nImageIndex):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|nDialogID|LONGINT||
|nComponentID|LONGINT||
|nColumnIndex|INTEGER||
|nImageIndex|INTEGER||

## Version
Availability: from VectorWorks 2008
## Category
* Dialogs - Modern - Browser